Catalogs/ДелоОБанкротстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ДелоОБанкротстве</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДелаОБанкротстве</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанкротствоЗначенияСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСудебногоДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СообщенияОБанкротстве</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСообщения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СообщениеБанкротства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСообщения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанкротствоЗначенияСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСудебногоРешения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанкротствоЗначенияСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СостояниеДоБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СостояниеДоБ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанкротствоЗначенияСвойств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СообщениеБанкротства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСудебногоРешения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанкротствоЗначенияСвойств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДелоОБанкротстве</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСудебногоДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ДелоОБанкротстве/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗСообщений.ТипСообщения КАК ТипСообщения,
	|	ТЗСообщений.ДатаСообщения КАК ДатаСообщения
	|ПОМЕСТИТЬ ВТ_ТЗСообщений
	|ИЗ
	|	&ТЗСообщений КАК ТЗСообщений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_ТЗСообщений.ТипСообщения КАК ТипСообщения
	|ИЗ
	|	ВТ_ТЗСообщений КАК ВТ_ТЗСообщений
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТЗСообщений.ДатаСообщения УБЫВ";
	
	Запрос.УстановитьПараметр("ТЗСообщений", ЭтотОбъект.СообщенияОБанкротстве.Выгрузить());
	Выборка =  Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтатусДелаОБанкротстве = Выборка.ТипСообщения;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДелоОБанкротствеСообщенияОБанкротстве.Ссылка КАК Доб,
		|	ДелоОБанкротствеСообщенияОБанкротстве.ДатаСообщения КАК Период,
		|	ДелоОБанкротствеСообщенияОБанкротстве.Сообщение КАК Сообщение,
		|	ДелоОБанкротствеСообщенияОБанкротстве.ТипСообщения КАК ТипСообщения,
		|	ДелоОБанкротствеСообщенияОБанкротстве.Ссылка.Контрагент КАК Контрагент,
		|	ДелоОБанкротствеСообщенияОБанкротстве.Ссылка.НомерСудебногоДела КАК НомерСудебногоДела,
		|	ДелоОБанкротствеСообщенияОБанкротстве.ТипСудебногоРешения КАК ТипСудебногоРешения
		|ИЗ
		|	Справочник.ДелоОБанкротстве.СообщенияОБанкротстве КАК ДелоОБанкротствеСообщенияОБанкротстве
		|ГДЕ
		|	ДелоОБанкротствеСообщенияОБанкротстве.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.СостояниеДоБ.СоздатьМенеджерЗаписи();	
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	КонтрагентОб = Контрагент.ПолучитьОбъект();
	КонтрагентОб.ЕстьДанныеОБанкротстве = Истина;
	КонтрагентОб.Записать();
	
КонецПроцедуры
